package compression

import (
	"reflect"
	"testing"
)

func TestLZWService_CompressAndDecompress(t *testing.T) {
	tests := []struct {
		name string
		data []byte
	}{
		{
			name: "",
			data: []byte("banana_bandana"),
		},
		{
			name: "",
			data: []byte("абабв аабаб"),
		},
		{
			name: "",
			data: []byte("Простой Текст - example"),
		},
		{
			name: "",
			data: []byte(`Я пишу до сих пор только о князьях, графах, министрах, сенаторах и их детях и боюсь, что и вперед не будет других лиц в моей истории.
			Может быть, это нехорошо и не нравится публике; может быть, для нее интереснее и поучительнее история мужиков, купцов, семинаристов, но, со всем моим желанием иметь как можно больше читателей, я не могу угодить такому вкусу, по многим причинам.
			Во-первых, потому, что памятники истории того времени, о котором я пишу, остались только в переписке и записках людей высшего круга грамотных; даже интересные и умные рассказы, которые мне удалось слышать, слышал я только от людей того же круга.
			Во-вторых, потому, что жизнь купцов, кучеров, семинаристов, каторжников и мужиков для меня представляется однообразною и скучною, и все действия этих людей мне представляются вытекающими, большей частью, из одних и тех же пружин: зависти к более счастливым сословиям, корыстолюбия и материальных страстей. Ежели и не все действия этих людей вытекают из этих пружин, то действия их так застилаются этими побуждениями, что трудно их понимать и потому описывать.
			В-третьих, потому, что жизнь этих людей (низших сословий) менее носит на себе отпечаток времени.
			В-четвертых, потому, что жизнь этих людей некрасива.
			В-пятых, потому, что я никогда не мог понять, что думает будочник, стоя у будки, что думает и чувствует лавочник, зазывая купить помочи и галстуки, что думает семинарист, когда его ведут в сотый раз сечь розгами, и т.п. Я так же не могу понять этого, как и не могу понять того, что думает корова, когда ее доят, и что думает лошадь, когда везет бочку.
			В-шестых, потому, наконец (и это, я знаю, самая лучшая причина), что я сам принадлежу к высшему сословию, обществу и люблю его.
			Я не мещанин, как с гордостью говорил Пушкин, и смело говорю, что я аристократ, и по рождению, и по привычкам, и по положению. Я аристократ потому, что вспоминать предков -- отцов, дедов, прадедов моих, мне не только не совестно, но особенно радостно. Я аристократ потому, что воспитан с детства в любви и уважении к изящному, выражающемуся не только в Гомере, Бахе и Рафаэле, но и всех мелочах жизни: в любви к чистым рукам, к красивому платью, изящному столу и экипажу. Я аристократ потому, что был так счастлив, что ни я, ни отец мой, ни дед мой не знали нужды и борьбы между совестью и нуждою, не имели необходимости никому никогда ни завидовать, ни кланяться, не знали потребности образовываться для денег и для положения в свете и тому подобных испытаний, которым подвергаются люди в нужде. Я вижу, что это большое счастье и благодарю за него Бога, но ежели счастье это не принадлежит всем, то из этого я не вижу причины отрекаться от него и не пользоваться им.
			Я аристократ потому, что не могу верить в высокий ум, тонкий вкус и великую честность человека, который ковыряет в носу пальцем и у которого душа с Богом беседует.
			Все это очень глупо, может быть, преступно, дерзко, но это так. И я вперед объявляю читателю, какой я человек и чего он может ждать от меня. Еще время закрыть книгу и обличить меня как идиота, ретрограда и Аскоченского, которому я, пользуясь этим случаем, спешу заявить давно чувствуемое мною искренное и глубокое нешуточное уважение*.`),
		},
	}

	for _, tt := range tests {
		t.Run(tt.name, func(t *testing.T) {
			l := &LZWService{}
			compressedData, err := l.Compress(tt.data)
			if err != nil {
				t.Errorf("LZWService.Compress() has err %s", err.Error())
				return
			}
			decompressedData, err := l.Decompress(compressedData)
			if err != nil {
				t.Errorf("LZWService.Decompress() has err = %v", err.Error())
				return
			}
			if !reflect.DeepEqual(decompressedData, tt.data) {
				t.Errorf("LZWService.Compress() = %v, want %v", string(decompressedData), string(tt.data))
			}
		})
	}
}

func BenchmarkCompress(b *testing.B) {
	data := []byte("Простой Текст - example")
	l := &LZWService{}
	for i := 0; i < b.N; i++ {
		l.Compress(data)
	}
}
